//=============================================================================
//
// 背景処理 [bg.h]
// Author : 
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAP_SIZE_X							(8)
#define MAP_SIZE_Y							(8)
#define CHIP_SIZE							(60.0f)
#define HALF_CHIP							(CHIP_SIZE / 2)

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBG(void);
void UninitBG(void);
void UpdateBG(void);
void DrawBG(void);

int GetMapEnter(D3DXVECTOR2 pos, D3DXVECTOR2 size);
int GetMap(int x, int y);